____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to
====================================================================================================
reshape_1 (Reshape)                (None, 1, 28, 28)   0           reshape_input_1[0][0]
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 1, 28, 28)   0           reshape_1[0][0]
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)    (None, 32, 24, 24)  832         dropout_1[0][0]
____________________________________________________________________________________________________
conv2dhighway_2 (Conv2DHighway)    (None, 32, 24, 24)  18496       convolution2d_1[0][0]
____________________________________________________________________________________________________
conv2dhighway_3 (Conv2DHighway)    (None, 32, 24, 24)  18496       conv2dhighway_2[0][0]
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)      (None, 32, 12, 12)  0           conv2dhighway_3[0][0]
____________________________________________________________________________________________________
dropout_2 (Dropout)                (None, 32, 12, 12)  0           maxpooling2d_1[0][0]
____________________________________________________________________________________________________
conv2dhighway_4 (Conv2DHighway)    (None, 32, 12, 12)  18496       dropout_2[0][0]
____________________________________________________________________________________________________
conv2dhighway_5 (Conv2DHighway)    (None, 32, 12, 12)  18496       conv2dhighway_4[0][0]
____________________________________________________________________________________________________
conv2dhighway_6 (Conv2DHighway)    (None, 32, 12, 12)  18496       conv2dhighway_5[0][0]
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)      (None, 32, 6, 6)    0           conv2dhighway_6[0][0]
____________________________________________________________________________________________________
dropout_3 (Dropout)                (None, 32, 6, 6)    0           maxpooling2d_2[0][0]
____________________________________________________________________________________________________
conv2dhighway_7 (Conv2DHighway)    (None, 32, 6, 6)    18496       dropout_3[0][0]
____________________________________________________________________________________________________
conv2dhighway_8 (Conv2DHighway)    (None, 32, 6, 6)    18496       conv2dhighway_7[0][0]
____________________________________________________________________________________________________
conv2dhighway_9 (Conv2DHighway)    (None, 32, 6, 6)    18496       conv2dhighway_8[0][0]
____________________________________________________________________________________________________
maxpooling2d_3 (MaxPooling2D)      (None, 32, 3, 3)    0           conv2dhighway_9[0][0]
____________________________________________________________________________________________________
dropout_4 (Dropout)                (None, 32, 3, 3)    0           maxpooling2d_3[0][0]
____________________________________________________________________________________________________
flatten_1 (Flatten)                (None, 288)         0           dropout_4[0][0]
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 10)          2890        flatten_1[0][0]
====================================================================================================
Total params: 151690
____________________________________________________________________________________________________
